---
type: AnalyticalOpening
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# AnalyticalOpening

`Autodesk.Revit.DB.Structure.AnalyticalOpening` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2023 | `public static AnalyticalOpening Create ( Document aDoc , CurveLoop curveLoop , ElementId panelId )` |
| Method | IsCurveLoopValidForAnalyticalOpening | 2023 | `public static bool IsCurveLoopValidForAnalyticalOpening ( CurveLoop loop , Document aDoc , ElementId panelId )` |
| Property | PanelId | 2023 | `public ElementId PanelId { get ; }` |
| Property | Parameter | — | `` |